Autodesk.Navisworks.Api.Application
The singleton object that represents the application.

Autodesk.Navisworks.Api.Application.ActiveDocument
Gets a reference to the current Document being displayed in a View

Autodesk.Navisworks.Api.Application.ActiveDocumentChanged
Occurs when the ActiveDocument has changed

Autodesk.Navisworks.Api.Application.ActiveDocumentChanging
Occurs when the ActiveDocument is about to change

Autodesk.Navisworks.Api.Application.Automation
Gets a reference to the
ApplicationAutomation singleton,
which provides the same interface for automation as NavisWorksApplication in the Automation assembly

Autodesk.Navisworks.Api.Application.BeginProgress
Provides an instance of the Progress class
which starts reporting of progress of an operation, typically displaying a progress bar
or dialog to the end user.

Autodesk.Navisworks.Api.Application.BeginProgress(System.String)
Provides an instance of the Progress class
which starts reporting of progress of an operation, typically displaying a progress bar
or dialog to the end user.
title: Title for the overall progress operation

Autodesk.Navisworks.Api.Application.BeginProgress(System.String,System.String)
Provides an instance of the Progress class
which starts reporting of progress of an operation, typically displaying a progress bar
or dialog to the end user.
title:
Title for the overall progress operation (title for Navisworks progress dialog)
message:
Message describing the current operation (body of Navisworks progress dialog)

Autodesk.Navisworks.Api.Application.Bim360
Provides access to the BIM360 state of the application of which is hosting the API. Will be null
if the application doesn't have BIM360 state.

Autodesk.Navisworks.Api.Application.Bim360Created
Occurs when the Application's BIM360 state been created. Bim360 will be non-null.

Autodesk.Navisworks.Api.Application.Bim360Destroying
Occurs when the Application's BIM360 state is about to be destroyed. Bim360 will be set to
null after this event has been raised.

Autodesk.Navisworks.Api.Application.DocumentAdded
Occurs when a Document has been added to the Documents
collection. Typically soon after the Document has been created.

Autodesk.Navisworks.Api.Application.DocumentRemoved
Occurs when a Document has been removed from the Documents
collection. Typically shortly before the Document is destroyed.

Autodesk.Navisworks.Api.Application.Documents
Gets a reference to the Read Only collection of documents currently open

Autodesk.Navisworks.Api.Application.DragDrop
Provides access to Drag Drop utilities.

Autodesk.Navisworks.Api.Application.EndProgress
Finishes the operation and disposes of the Progress control allocated using BeginProgress()

Autodesk.Navisworks.Api.Application.FileInteractiveResolved
Occurs when a file reference has been interactively resolved. Raised before FileResolved if
automatic resolution has failed.

Autodesk.Navisworks.Api.Application.FileInteractiveResolving
Occurs when a file reference needs to be interactively resolved. Raised after FileResolving
if automatic resolution has failed.

Autodesk.Navisworks.Api.Application.FileResolved
Occurs when a file reference has been resolved. Typically when opening a file.

Autodesk.Navisworks.Api.Application.FileResolving
Occurs when a file reference needs to be resolved. Typically when opening a file.

Autodesk.Navisworks.Api.Application.GetCustomColors
Retrieve the custom colors for the current session
Returns: The custom colors for the current session

Autodesk.Navisworks.Api.Application.Gui
Provides information about the Gui of the application which is hosting the API. Will be null
if the application doesn't have a Gui.

Autodesk.Navisworks.Api.Application.GuiCreated
Occurs when the Application's GUI has been created. Gui will be non-null.

Autodesk.Navisworks.Api.Application.GuiDestroying
Occurs when the Application's GUI is about to be destroyed. Gui will be set to
null after this event has been raised.

Autodesk.Navisworks.Api.Application.Idle
Occurs when the application finishes processing and is about to enter the idle state.

Autodesk.Navisworks.Api.Application.IsAutomated
Gets whether this instance is running under Automation

Autodesk.Navisworks.Api.Application.IsUserDataCollectionEnabled
Is user data collection enabled.

Autodesk.Navisworks.Api.Application.LoadDocumentInfo(System.String)
Load DocumentInfo.
fileName: fileName to load DocumentInfo from
Returns: Returns DocumentInfo if success
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to open file

Autodesk.Navisworks.Api.Application.MainDocument
Gets a reference to the Primary Document being worked on. Once set the MainDocument does
not change for the lifetime of the application.

Autodesk.Navisworks.Api.Application.MainDocumentChanged
Occurs when the MainDocument has changed

Autodesk.Navisworks.Api.Application.MainDocumentChanging
Occurs when the MainDocument is about to change.

Autodesk.Navisworks.Api.Application.Options
Provides access to Application Options.

Autodesk.Navisworks.Api.Application.Plugins
Provides information about the Plugins available
in the application runtime

Autodesk.Navisworks.Api.Application.PostUserMessage(System.String,System.String,Autodesk.Navisworks.Api.MessageCenterCategory,System.String,System.String,System.Int32)


Autodesk.Navisworks.Api.Application.ProgressBeginning
Occurs when BeginProgress() is called.
If any handler markes the event as handled, the standard progress dialog will not be displayed.

Autodesk.Navisworks.Api.Application.ProgressEnded
Occurs when EndProgress is called.

Autodesk.Navisworks.Api.Application.ProgressErrorReporting
Occurs when an error occurs during the lifetime of a
Progress object.
For example, if an error occurs whilst opening a large file the error
can be displayed to the user who is offered the chance to cancel.

Autodesk.Navisworks.Api.Application.ProgressMessageReporting
Occurs during Progress
reporting when message describing current operation is updated.

Autodesk.Navisworks.Api.Application.ProgressSubOperationBegan
Occurs when Progress.BeginSubOperation
is called.

Autodesk.Navisworks.Api.Application.ProgressSubOperationEnded
Occurs when Progress.EndSubOperation
is called.

Autodesk.Navisworks.Api.Application.ProgressUpdating
Occurs during Progress
reporting when progress is updated.

Autodesk.Navisworks.Api.Application.ProgressVisibility
Occurs when Progress.SetVisible
is called.

Autodesk.Navisworks.Api.Application.RegisterBitmap(System.Drawing.Bitmap)
Register a bitmap for later use by the graphics system. The function returns
an integer ID, or -1 if registration failed.

Autodesk.Navisworks.Api.Application.Resources
Provides access to Application Resources.

Autodesk.Navisworks.Api.Application.SetCustomColors(System.Int32[])
Set the custom colors for the current session
customColors: The custom colors to set for the current session

Autodesk.Navisworks.Api.Application.Title
Title for application. Suitable for display in window title bar, or similar.

Autodesk.Navisworks.Api.Application.TryLoadDocumentInfo(System.String)
Try to Load DocumentInfo.
fileName: fileName to load DocumentInfo from
Returns: Returns null if failed

Autodesk.Navisworks.Api.Application.UnregisterBitmap(System.Int32)
Unregister a previously registered bitmap. The function returns
true if successful, or false otherwise.

Autodesk.Navisworks.Api.Application.UserMessagePosted


Autodesk.Navisworks.Api.Application.Version
Provides information about the version of the currently running API and Runtime